run/circularBump/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 572.9 0 0 );

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ( 572.9 0 0 );
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 572.9 0 0 );
    }
    walls
    {
        type            slip;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
