run/circularBump/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nx  80;
ny  80;

scale   1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (0 1 0.1)

    (2 0 0)
    (2 1 0)
    (2 0 0.1)
    (2 1 0.1)

    (3 0 0)
    (3 1 0)
    (3 0 0.1)
    (3 1 0.1)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny 1) simpleGrading (1 1 1)
    hex (1 8 9 2 5 10 11 6) ($nx $ny 1) simpleGrading (1 1 1)
    hex (8 12 13 9 10 14 15 11) ($nx $ny 1) simpleGrading (1 1 1)
);

edges
(
    arc 1 8 (1.5 0.04 0)
    arc 5 10 (1.5 0.04 0.1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 4 7)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (12 13 14 15)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 4 5)
            (2 3 6 7)
            (1 5 8 10)
            (2 6 9 11)
            (8 10 12 14)
            (9 11 13 15)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
            (1 2 8 9) 
            (5 6 10 11)
            (8 9 12 13)
            (10 11 14 15)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
